agenticaiuw/hivemind/firmware/nrf9160/src/main.c
/*
 * ---- Audio thread ----
 *
 * i2s_nrfx kills the ENTIRE duplex transfer if the app misses a buffer
 * deadline by one block (20.48 ms) — "No room in RX queue" / "Failed to
 * allocate next RX buffer". Opus encode+decode on the same thread spiked
 * to 91 ms, so no buffer depth could ever make that safe.
 *
 * This thread therefore does ONLY pointer shuffling: read an RX block,
 * hand the pointer to main, keep the TX runway full. It never touches a
 * codec, so its loop is microseconds. It runs at a cooperative priority so
 * it always wins over main, and it blocks on i2s_read every iteration
 * (never starving the system). When main falls behind, mic blocks are
 * dropped — audio degrades, the transfer survives.
 */
#define AUDIO_THREAD_STACK_BYTES 1536
#define AUDIO_THREAD_PRIORITY -2
#define MIC_RAW_QUEUE_SLOTS 6U
static K_THREAD_STACK_DEFINE(audio_thread_stack, AUDIO_THREAD_STACK_BYTES);
static struct k_thread audio_thread_data;
K_MSGQ_DEFINE(mic_raw_q, sizeof(void *), MIC_RAW_QUEUE_SLOTS, sizeof(void *));
static const struct device *audio_i2s_dev;
static atomic_t audio_thread_error;

/*
 * ---- WS I/O thread ----
 *
 * The audio loop must queue a TX block every ~20 ms or i2s_nrfx errors the
 * whole duplex transfer — but modem sends can stall for hundreds of ms on
 * LTE. So sockets live on their own thread: the audio loop only touches
 * the uplink byte ring (SPSC: main produces, ws thread consumes), the
 * downlink frame pipe (ws thread produces, main consumes), and two atomic
 * control flags. Codec work stays on main (shared pseudostack).
 */
#define WS_IO_STACK_BYTES 2560
#define WS_IO_PRIORITY 5
static K_THREAD_STACK_DEFINE(ws_io_stack, WS_IO_STACK_BYTES);
static struct k_thread ws_io_thread_data;
static K_MUTEX_DEFINE(ws_lock); /* serializes pendant_ws_* across threads */
/*
 * Downlink frames cross threads as whole messages, never a byte stream: a
 * message queue makes every get atomic, so a torn or mis-framed record is
 * structurally impossible and no free-space bookkeeping is needed.
 */
struct dl_frame {
	uint16_t length;
	uint8_t data[WS_RX_BUF_BYTES];
};
#define DL_FRAME_SLOTS 6U
K_MSGQ_DEFINE(dl_frames, sizeof(struct dl_frame), DL_FRAME_SLOTS, 4);
static atomic_t convo_active;    /* audio loop live: pump/recv at full rate */
/*
 * The relay's {started} for THIS conversation. The WebSocket outlives
 * individual conversations, so the previous one's trailing {end} (and any
 * late reply audio) can still be in flight when the next one begins —
 * which killed a fresh conversation 80 ms in. Nothing from the downlink
 * counts until {started} arrives.
 */
static atomic_t convo_started;
static atomic_t convo_flush_req; /* relay said flush (barge-in) */
static atomic_t convo_end_req;   /* relay said end / transport died */
/*
 * Uplink gate: 1 = the WS I/O thread may drain the encoder FIFO onto the
 * radio, 0 = it must leave the bytes where they are. Set to 1 before the
 * first mic block of a conversation and cleared at teardown, so a stray
 * pump between presses can never transmit.
 */
static atomic_t convo_uplink_gate;
static uint8_t ws_rx_buf[WS_RX_BUF_BYTES];  /* ws thread only */
static struct dl_frame dl_tx_frame;         /* ws thread only */
static struct dl_frame dl_rx_frame;         /* main thread only */
/* Duplex diagnostics — printed at every conversation end. */
static uint32_t convo_tx_blocks;
/*
 * Underrun EVENTS, not silent samples. The runway running dry is normal at the
 * tail of every agent utterance, so counting per sample just measures how long
 * the agent stayed quiet. Only the dry/not-dry transition says the decoder
 * failed to keep up.
 */
static uint32_t convo_tx_starved;
static bool convo_tx_dry;
static uint32_t convo_rx_blocks;
static uint32_t convo_decoded_packets;
static uint32_t convo_max_loop_ms;
static uint32_t convo_uplink_drops;
static uint32_t convo_mic_drops;
static uint32_t convo_tx_peak;
/*
 * Adaptive duplex uplink state. Main thread only: the conversation loop is the
 * sole writer and live_tx_offer_stage (same thread) the sole reader, so no
 * atomics are needed. convo_uplink_held / convo_uplink_duck_ms are the effect
 * counters — read them against uplink_drops to see whether the duck actually
 * kept the ring off its ceiling.
 */
static bool convo_uplink_ducked;
static bool convo_uplink_holding;
static int64_t convo_dl_active_until;
static int64_t convo_adapt_last_ms;
static uint32_t convo_uplink_duck_ms;
static uint32_t convo_uplink_held;
/*
 * Codec cost, measured not guessed. The 32.768 kHz cycle counter gives
 * 30.5 us resolution — plenty for multi-millisecond codec calls, and it
 * settles whether a given sample rate actually fits the CPU budget.
 */
static uint32_t convo_decode_cycles;
static uint32_t convo_decode_calls;
static uint32_t convo_decode_max_cycles;
static uint32_t convo_encode_cycles;
static uint32_t convo_encode_calls;
static uint32_t convo_encode_max_cycles;

static inline uint32_t cycles_to_us(uint32_t cycles)
{
	return (uint32_t)(((uint64_t)cycles * 1000000U) /
			  sys_clock_hw_cycles_per_sec());
}
K_MEM_SLAB_DEFINE_STATIC(convo_tx_slab,
			 CONVO_TX_BLOCK_FRAMES * sizeof(int32_t),
			 CONVO_TX_SLAB_BLOCKS, 4);

static const struct gpio_dt_spec led =
	GPIO_DT_SPEC_GET(LED_NODE, gpios);
static const struct gpio_dt_spec button =
	GPIO_DT_SPEC_GET(BUTTON_NODE, gpios);
static struct gpio_callback button_callback;
#ifdef CONFIG_PENDANT_OFFLINE_STORE
static const struct gpio_dt_spec mark_button =
	GPIO_DT_SPEC_GET(MARK_BUTTON_NODE, gpios);
static struct gpio_callback mark_button_callback;
#endif
static FATFS sd_fat_fs;
static struct fs_mount_t sd_mount = {
	.type = FS_FATFS,
	.mnt_point = SD_MOUNT_POINT,
	.fs_data = &sd_fat_fs,
	.flags = FS_MOUNT_FLAG_NO_FORMAT,
};

K_SEM_DEFINE(button_press_sem, 0, 1);
#ifdef CONFIG_PENDANT_OFFLINE_STORE
K_SEM_DEFINE(mark_press_sem, 0, 1);
#endif

/*
 * Mic RX slab is dedicated. audio_workspace is the live PCM TX ring during
 * capture and the Opus decode workspace for reply playback.
 */
static struct k_mem_slab mic_rx_slab;
static uint8_t mic_rx_storage[MIC_RX_BLOCK_SIZE * MIC_RX_BLOCK_COUNT]
	__aligned(4);
static uint8_t audio_workspace[PENDANT_AUDIO_WORKSPACE_BYTES] __aligned(4);
BUILD_ASSERT(sizeof(mic_rx_storage) ==
		     MIC_RX_BLOCK_SIZE * MIC_RX_BLOCK_COUNT,
	     "mic RX storage size mismatch");
/* Processed audio staged between microSD writes (~1 KiB stages). */
static int16_t mic_stage_samples[MIC_STAGE_FRAMES] __aligned(4);
static bool live_stream_failed;
/*
 * Ring saturated during live-only capture: the link fell ~4 s behind. End
 * the utterance with what the link carried instead of failing the cycle —
 * distinct from live_stream_failed, which means the socket itself died.
 */
static bool live_tx_saturated;
/* Defined below with the other capture globals. */
extern volatile bool recording_on_sd;

