agenticaiuw/hivemind/firmware/nrf9160/src/main.c
/* PWM duty words: bit 15 clear means the output is low first, so BCLK
 * rises mid-period (tick 4 of 8) while LRCLK edges (tick 0 mod 256) sit
 * on BCLK falling edges, and LRCLK starts low = left slot first.
 * Sequences must live in data RAM for EasyDMA.
 */
static uint16_t mic_bclk_duty[1] __aligned(4) = { MIC_BCLK_TOP / 2U };
static uint16_t mic_lrclk_duty[1] __aligned(4) = { MIC_LRCLK_TOP / 2U };
/* Held while the mic clocks run so PCLK16M is crystal-accurate. */
static struct onoff_manager *mic_hfclk_mgr;
/*
 * DPPI channel for phase-locked PWM starts, allocated through the
 * shared nrfx allocator.  Never hardcode one: the UART console's
 * enhanced poll-out already owns the topmost channel, and disabling
 * someone else's channel wedges that peripheral permanently.
 */
static int mic_dppi_channel = -1;

volatile int audio_cycle_result = -9999;
volatile uint8_t audio_cycle_phase;
volatile uint32_t recorded_samples;
volatile uint16_t recorded_peak;
volatile bool recording_stopped_by_button;
volatile bool sd_ready;
volatile bool recording_on_sd;
volatile int sd_mount_result = -9999;
volatile uint64_t recording_absolute_sum;
volatile bool sd_persistence_verified;
volatile uint32_t sd_boot_count;
volatile int sd_test_read_result = -9999;
volatile int sd_test_write_result = -9999;

static void button_pressed(const struct device *port,
			   struct gpio_callback *callback,
			   gpio_port_pins_t pins)
{
	ARG_UNUSED(port);
	ARG_UNUSED(callback);
	ARG_UNUSED(pins);
	k_sem_give(&button_press_sem);
}

/*
 * Debug press hook: a debugger (J-Link) can write 1 here to simulate a
 * button press without touching the hardware —
 *   JLinkExe -device nRF9160_xxAA -if SWD -speed 4000 -autoconnect 1
 *   w4 <&pendant_remote_press> 1
 * Polled wherever the firmware waits on the button.
 */
volatile uint32_t pendant_remote_press;

static bool take_remote_press(void)
{
	if (pendant_remote_press == 0U) {
		return false;
	}
	pendant_remote_press = 0U;
	return true;
}

#ifdef CONFIG_PENDANT_OFFLINE_STORE
static void mark_button_pressed(const struct device *port,
				struct gpio_callback *callback,
				gpio_port_pins_t pins)
{
	ARG_UNUSED(port);
	ARG_UNUSED(callback);
	ARG_UNUSED(pins);
	k_sem_give(&mark_press_sem);
}

/*
 * Same shape as pendant_remote_press: plain volatile globals a J-Link writes
 * over SWD, no protocol on the target.
 *
 *   w4 <&pendant_remote_mark> 1     drop a moment bookmark
 *   w4 <&pendant_remote_offline> 1  take the modem OFFLINE (CFUN=4)
 *   w4 <&pendant_remote_offline> 0  bring it back and reattach
 *
 * pendant_remote_offline is how the offline path is proven without shielding
 * the antenna: it is the only way to make "no usable link" a repeatable
 * condition rather than a story about a lift shaft.
 */
volatile uint32_t pendant_remote_mark;
volatile uint32_t pendant_remote_offline;
static bool link_forced_offline;

static bool take_mark_press(void)
{
	if (k_sem_take(&mark_press_sem, K_NO_WAIT) == 0) {
		return true;
	}
	if (pendant_remote_mark != 0U) {
		pendant_remote_mark = 0U;
		return true;
	}
	return false;
}

/*
 * Apply the debug offline request. Closing the WebSocket first matters: the
 * socket is modem-offloaded, so dropping RF underneath it leaves a
 * descriptor that reports connected and fails every send.
 */
static void apply_forced_link_state(void)
{
	bool want_offline = pendant_remote_offline != 0U;

	if (want_offline == link_forced_offline) {
		return;
	}
	if (want_offline) {
		printk("DEBUG: forcing link offline (store-and-forward test)\n");
		k_mutex_lock(&ws_lock, K_FOREVER);
		pendant_ws_close();
		k_mutex_unlock(&ws_lock);
		pendant_cloud_stream_abort();
		/*
		 * Latch BEFORE powering the radio down: pendant_cloud's
		 * ensure_lte_data_ready() resumes a suspended radio in front
		 * of every socket, so suspending alone lasts exactly until
		 * the next press and the capture would come back online
		 * mid-test.
		 */
		pendant_cloud_block_link(true);
		(void)pendant_cloud_suspend_radio();
		link_forced_offline = true;
	} else {
		printk("DEBUG: restoring link\n");
		pendant_cloud_block_link(false);
		(void)pendant_cloud_resume_radio();
		link_forced_offline = false;
	}
}

static bool link_is_forced_offline(void)
{
	return link_forced_offline;
}
#else
static inline void apply_forced_link_state(void) {}
static inline bool link_is_forced_offline(void)
{
	return false;
}
static inline bool take_mark_press(void)
{
	return false;
}
#endif /* CONFIG_PENDANT_OFFLINE_STORE */

/*
 * Button 2 double-press gesture detector (reflex trigger).
 *
 * The single press stays a bookmark, and the header's original argument
 * for button 2 still holds: never make the COMMON action wait for gesture
 * disambiguation.  So the 600 ms second-press window opens ONLY while a
 * gesture recipe is actually armed — with none armed this returns
 * immediately and the bookmark costs exactly what it always cost.  With
 * one armed, the bookmark is delayed by at most the detection window,
 * which is the documented ceiling for this trade.
 *
 * Returns true when a second press landed inside the window (the caller
 * fires the gesture recipes instead of bookmarking).  Edges within the
 * first 100 ms are switch bounce of the SAME press, not a human double —
 * counting them would turn every scratchy contact into a gesture.
 */
#define MARK_GESTURE_WINDOW_MS 600
#define MARK_GESTURE_DEBOUNCE_MS 100

static bool reflex_mark_double_press(void)
{
	int64_t opened_at;

	if (!pendant_reflex_gesture_armed()) {
		return false;
	}
	opened_at = k_uptime_get();
	while (k_uptime_get() - opened_at < MARK_GESTURE_WINDOW_MS) {
		k_msleep(10);
		if (take_mark_press()) {
			if (k_uptime_get() - opened_at <
			    MARK_GESTURE_DEBOUNCE_MS) {
				continue;
			}
			printk("Button 2 double-press gesture (%d ms apart)\n",
			       (int)(k_uptime_get() - opened_at));
			return true;
		}
	}
	return false;
}

#ifdef CONFIG_PENDANT_MIC_INJECT
/*
 * Debug mic injection (harness builds only; see CONFIG_PENDANT_MIC_INJECT).
 *
 * Every end-to-end test used to play speech out of the host's speakers so the
 * physical I2S mic would hear it.  That rig has two variables nobody was
 * holding still — the laptop's distance from the pendant and the host output
 * volume — so any conclusion about capture level was unfalsifiable.  This path
 * replaces the staged mic PCM with bytes the debugger wrote, which makes an
 * utterance reproducible to the sample.
 *
 * Same shape as pendant_remote_press above: plain volatile globals a J-Link
 * writes over SWD, no protocol, no driver on the target.  Layout is a true
 * SPSC ring — the host owns head, this firmware owns tail, fill is derived —
 * so the two sides never need a lock across the debug port.
 *
 *   w4 <&pendant_inject_arm> 1        arm (do this before the press)
 *   <block-write G.711 mu-law bytes into pendant_inject_ring at head>
 *   w4 <&pendant_inject_head> <n>     publish the frames just written
 *   w4 <&pendant_inject_eof> 1        no more PCM coming; stop counting
 *                                     underruns and emit silence
 *
 * A power-of-two frame count lets the index difference be a mask instead of a
 * modulo, and makes the unsigned wrap of (head - tail) exact.
 *
 * WIRE FORMAT IS 8-BIT G.711 mu-LAW, NOT LINEAR PCM, and that is a measured
 * decision.  Every block-write front-end this debug port has was benchmarked
 * against the 31,250 B/s a 16-bit mic stage would consume:
 *
 *   JLinkExe w4 (2 frames/command)         7,960 B/s   3.9x too slow
 *   JLinkExe w8 (4 frames/command)        14,054 B/s   2.2x too slow
 *   JLinkExe loadfile                      resets the MCU — unusable outright
 *   JLinkGDBServer RSP 'X' block write   ~139,000 B/s   on an IDLE target
 *
 * The last number is the trap.  J-Link Commander costs ~0.5 ms per command no
 * matter how small, so only the GDB server's block write is even in range —
 * but its idle throughput is not the throughput available during a call.  The
 * debug port reaches RAM over the AHB-AP, and it contends with a CPU that is
 * running Opus, I2S EasyDMA and the LTE stack.  Traced mid-conversation, the
 * same writes fell to 27-51 kB/s typical with a 114 ms outlier (18 kB/s) — at
 * or below the 31,250 B/s that 16-bit audio needs.  That is a SUSTAINED rate
 * deficit, which no amount of extra buffer can fix; it can only be fixed by
 * sending fewer bytes.
 *
 * mu-law halves the wire rate to 15,625 B/s (~2.2x headroom against the
 * measured in-call median) and simultaneously doubles the runway this fixed
 * 4 KB of RAM buys, because a frame costs one byte instead of two — 262 ms,
 * enough to swallow the 114 ms outliers outright.  The expansion is the same
 * deterministic table the legacy reply path already uses, so an utterance
 * still decodes to identical samples on every run, which is the entire
 * property this rig exists to provide.  The uplink is ~16 kbps Opus SILK-WB,
 * far lossier than G.711, so the quantization costs nothing that survives to
 * the relay.
 */
#define PENDANT_INJECT_RING_FRAMES 4096U
#define PENDANT_INJECT_RING_MASK (PENDANT_INJECT_RING_FRAMES - 1U)
BUILD_ASSERT((PENDANT_INJECT_RING_FRAMES &
	      (PENDANT_INJECT_RING_FRAMES - 1U)) == 0U,
	     "inject ring must be a power of two");
BUILD_ASSERT(PENDANT_INJECT_RING_FRAMES >= 2U * MIC_STAGE_FRAMES,
	     "inject ring must hold at least two stages of runway");

