agenticaiuw/hivemind/firmware/nrf9160/src/main.c
	/*
	 * Before LTE, deliberately: the queue must come back from the card
	 * whether or not this boot ever gets signal. A recovery path that
	 * depends on the network is not a recovery path.
	 */
	pendant_store_init();

	/*
	 * Reflex layer, also before LTE for the same reason: a timer or a
	 * daily nudge that only exists once the network is up is not a
	 * reflex.  Haptic first — its single boot probe decides whether
	 * every haptic action runs the motor or degrades to LED.
	 */
	(void)haptic_init();
	pendant_reflex_init(&reflex_ops_impl);

#if PENDANT_BOOT_DUMP_PCM_HEX
	if (sd_ready) {
		(void)dump_sd_recording_hex();
	}
#endif

	/* Boot card check: two slow flashes means the required SD card mounted. */
	for (unsigned int flash = 0U; flash < 2U; ++flash) {
		gpio_pin_set_dt(&led, 1);
		k_msleep(160);
		gpio_pin_set_dt(&led, 0);
		k_msleep(160);
	}

#if PENDANT_BOOT_AUTORECORD_TEST
	clear_button_events();
	printk("BOOT_MIC_AUTOTEST_BEGIN\n");
	error = record_microphone(i2s, AUTORECORD_TEST_SAMPLE_COUNT);
	gpio_pin_set_dt(&led, 0);
	printk("BOOT_MIC_AUTOTEST_END result=%d samples=%u\n",
	       error, recorded_samples);
	report_main_stack_headroom("capture");
	if (error != 0) {
		audio_cycle_result = error;
		show_error();
	}
#endif

#if PENDANT_BOOT_ENCODE_SELFTEST
	/* Runs before LTE so a network problem cannot mask a codec fault. */
	if (encode_stack_selftest() != 0) {
		printk("Encode stack selftest failed\n");
	}
#endif

	/*
	 * Solid LED while LTE attaches (up to CONFIG_LTE_NETWORK_TIMEOUT).
	 * Off after success = ready for Button 1 (recording blinks ~250 ms).
	 * Rapid 100 ms blink = show_error() after attach failure.
	 */
	printk("LTE init begin (LED solid = attaching; live Opus enabled)\n");
	gpio_pin_set_dt(&led, 1);
	error = pendant_cloud_init();
	gpio_pin_set_dt(&led, 0);
	if (error != 0) {
		printk("LTE initialization failed: %d\n", error);
		audio_cycle_result = error;
		show_error();
	}
	printk("LTE OK — ready for button (press = record + live upload)\n");

	/* Socket I/O lives on its own thread from here on: audio deadlines
	 * on main can never be blocked by a stalled modem send. */
	k_thread_create(&ws_io_thread_data, ws_io_stack,
			K_THREAD_STACK_SIZEOF(ws_io_stack), ws_io_thread_fn,
			NULL, NULL, NULL, WS_IO_PRIORITY, 0, K_NO_WAIT);
	k_thread_name_set(&ws_io_thread_data, "ws_io");

	/* And the I2S deadlines live on a cooperative thread that does
	 * nothing but move buffers — codecs can never delay it. */
	audio_i2s_dev = i2s;
	k_thread_create(&audio_thread_data, audio_thread_stack,
			K_THREAD_STACK_SIZEOF(audio_thread_stack),
			audio_thread_fn, NULL, NULL, NULL,
			AUDIO_THREAD_PRIORITY, 0, K_NO_WAIT);
	k_thread_name_set(&audio_thread_data, "audio");

	if (CONFIG_PENDANT_BOOT_AGENT_JOB_ID[0] != '\0') {
		printk("BOOT_AGENT_REPLY_TEST_BEGIN job=%s\n",
		       CONFIG_PENDANT_BOOT_AGENT_JOB_ID);
		error = pendant_cloud_set_job_id_for_diagnostic(
			CONFIG_PENDANT_BOOT_AGENT_JOB_ID);
		if (error == 0) {
			error = pendant_cloud_wait_for_agent_reply(
				PENDANT_CLOUD_REPLY_AUDIO_PATH);
		}
		if (error == 0 &&
		    pendant_cloud_reply_format ==
			    PENDANT_CLOUD_AUDIO_OGG_OPUS) {
			struct pendant_opus_stats decode_stats;

			error = pendant_opus_decode_file(
				PENDANT_CLOUD_REPLY_AUDIO_PATH,
				PENDANT_CLOUD_REPLY_PCM_PATH,
				audio_workspace, sizeof(audio_workspace),
				&decode_stats);
		}
		printk("BOOT_AGENT_REPLY_TEST_END result=%d HTTP=%d "
		       "PCM bytes=%u\n",
		       error, pendant_cloud_last_http_status,
		       pendant_cloud_reply_pcm_bytes);
	}

#if PENDANT_BOOT_UPLOAD_EXISTING
	printk("Boot diagnostic: uploading existing SD PCM recording\n");
	gpio_pin_set_dt(&led, 1);
	int64_t lat_cycle_started = k_uptime_get();
	struct fs_dirent boot_entry;

	error = fs_stat(SD_RECORDING_PATH, &boot_entry);
	if (error == 0 && boot_entry.type == FS_DIR_ENTRY_FILE &&
	    boot_entry.size > 0U) {
		error = pendant_cloud_upload_recording(
			SD_RECORDING_PATH, (uint32_t)boot_entry.size,
			SAMPLE_RATE);
	} else if (error == 0) {
		error = -ENODATA;
	}
	printk("LAT cycle_to_dispatch_ms=%lld\n",
	       k_uptime_get() - lat_cycle_started);
	gpio_pin_set_dt(&led, 0);
	printk("Boot upload result: %d (transcribe=%d dispatch=%d HTTP=%d "
	       "PCM bytes=%u)\n",
	       error, pendant_cloud_transcribe_result,
	       pendant_cloud_dispatch_result,
	       pendant_cloud_last_http_status,
	       pendant_cloud_uploaded_pcm_bytes);
	report_main_stack_headroom("boot upload");
	audio_cycle_result = error;
#endif

	clear_button_events();

#if PENDANT_BOOT_AUDIO_CYCLE_TEST
	bool boot_audio_cycle_test_pending = true;
#endif
#if PENDANT_BOOT_CONVERSATION_TEST
	bool boot_conversation_test_pending = true;
#endif

	while (true) {
		/*
		 * Ready: hold ONE WebSocket open (pings keep Cloudflare's
		 * 100 s idle killer away) instead of rebuilding TLS every
		 * 15 s like the chunked-HTTP prewarm had to.
		 */
		audio_cycle_phase = 0U;
		gpio_pin_set_dt(&led, 0);
		apply_forced_link_state();
		if (!pendant_ws_connected() && !link_is_forced_offline()) {
			int ws_error;

			k_mutex_lock(&ws_lock, K_FOREVER);
			ws_error = pendant_ws_connect();
			k_mutex_unlock(&ws_lock);
			if (ws_error != 0) {
				printk("Idle WS connect failed: %d "
				       "(legacy HTTP path on next press)\n",
				       ws_error);
			}
		}

#if PENDANT_BOOT_AUDIO_CYCLE_TEST
		if (boot_audio_cycle_test_pending) {
			boot_audio_cycle_test_pending = false;
			k_msleep(1500);
			k_sem_give(&button_press_sem);
		}
#endif
#if PENDANT_BOOT_CONVERSATION_TEST
		if (boot_conversation_test_pending) {
			boot_conversation_test_pending = false;
			printk("SELFTEST_CONVERSATION_BEGIN window=%u s\n",
			       PENDANT_BOOT_CONVERSATION_SECONDS);
			k_msleep(1500);
			k_sem_give(&button_press_sem);
		}
#endif
		/* Wait for a press. The WS I/O thread keeps the idle socket
		 * alive (pings + stray drains); main only reconnects. */
		bool marked = false;

		while (k_sem_take(&button_press_sem, K_MSEC(200)) != 0) {
			if (take_remote_press()) {
				break;
			}
			/*
			 * Button 2 needs no radio, no microphone and no
			 * decision about whether the link is usable. It is
			 * the one thing this device can always do.
			 *
			 * A double-press inside 600 ms is the reflex
			 * gesture; the window only opens while a gesture
			 * recipe is armed (see reflex_mark_double_press),
			 * so the plain bookmark path is undelayed until
			 * the owner installs one.
			 */
			if (take_mark_press()) {
				if (reflex_mark_double_press()) {
					pendant_reflex_fire_gesture();
					continue;
				}
				marked = true;
				break;
			}
			/*
			 * Reflex work rides the idle wait, the one context
			 * where I2S, the codec scratch and the SD card are
			 * all guaranteed unowned: store a pending downlink
			 * recipe (+ack upstream), then fire whatever came
			 * due.  Recipes received mid-conversation sit in
			 * their one-slot buffer until the conversation
			 * ends and this loop runs again.
			 */
			{
				char reflex_ack[96];

				if (pendant_reflex_process_pending(
					    reflex_ack,
					    sizeof(reflex_ack)) > 0 &&
				    pendant_ws_connected()) {
					k_mutex_lock(&ws_lock, K_FOREVER);
					(void)pendant_ws_send_text(
						reflex_ack);
					k_mutex_unlock(&ws_lock);
				}
			}
			pendant_reflex_tick();
			apply_forced_link_state();
			if (!pendant_ws_connected() &&
			    !link_is_forced_offline()) {
				int ws_error;

				k_mutex_lock(&ws_lock, K_FOREVER);
				ws_error = pendant_ws_connect();
				k_mutex_unlock(&ws_lock);
				if (ws_error != 0) {
					printk("Idle WS reconnect failed: %d\n",
					       ws_error);
				}
			}

